{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-company",
    "1": "B-facility",
    "2": "B-geo-loc",
    "3": "B-movie",
    "4": "B-musicartist",
    "5": "B-other",
    "6": "B-person",
    "7": "B-product",
    "8": "B-sportsteam",
    "9": "B-tvshow",
    "10": "I-company",
    "11": "I-facility",
    "12": "I-geo-loc",
    "13": "I-movie",
    "14": "I-musicartist",
    "15": "I-other",
    "16": "I-person",
    "17": "I-product",
    "18": "I-sportsteam",
    "19": "I-tvshow",
    "20": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-company": 0,
    "B-facility": 1,
    "B-geo-loc": 2,
    "B-movie": 3,
    "B-musicartist": 4,
    "B-other": 5,
    "B-person": 6,
    "B-product": 7,
    "B-sportsteam": 8,
    "B-tvshow": 9,
    "I-company": 10,
    "I-facility": 11,
    "I-geo-loc": 12,
    "I-movie": 13,
    "I-musicartist": 14,
    "I-other": 15,
    "I-person": 16,
    "I-product": 17,
    "I-sportsteam": 18,
    "I-tvshow": 19,
    "O": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
